In [1]:
import sqlite3
import os
import csv
import pandas as pd

# Create Database and Tables

In [2]:
connection = sqlite3.connect("Pet_Rescue.db")
cursor = connection.cursor()

In [3]:
# Create EMPLOYEES Table  
cursor.execute('''CREATE TABLE IF NOT EXISTS PETRESCUE (
                            ID INTEGER NOT NULL,
                            ANIMAL VARCHAR(20),
                            QUANTITY INTEGER,
                            COST DECIMAL(6,2),
                            RESCUEDATE DATE,
                            PRIMARY KEY (ID));''')

In [4]:
# Check table names
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

tables = cursor.fetchall()

for table in tables:
    print(f"Table Name: {table[0]}")

Table Name: PETRESCUE

In [5]:
# Check properties of the tables
for table in tables:
    table_name = table[0]
    print(f"\nProperties of table: {table_name}")
    
    cursor.execute(f"PRAGMA table_info({table_name});")
    
    columns = cursor.fetchall()
    for column in columns:
        cid, name, ctype, notnull, dflt_value, pk = column
        print(f"Column Name: {name}, Type: {ctype}, Not Null: {notnull}, Default Value: {dflt_value}, Primary Key: {pk}")

Properties of table: PETRESCUE
Column Name: ID, Type: INTEGER, Not Null: 1, Default Value: None, Primary Key: 1
Column Name: ANIMAL, Type: VARCHAR(20), Not Null: 0, Default Value: None, Primary Key: 0
Column Name: QUANTITY, Type: INTEGER, Not Null: 0, Default Value: None, Primary Key: 0
Column Name: COST, Type: DECIMAL(6,2), Not Null: 0, Default Value: None, Primary Key: 0
Column Name: RESCUEDATE, Type: DATE, Not Null: 0, Default Value: None, Primary Key: 0

# Insert Data to the Table

In [6]:
# Insert values into table
cursor.execute('''INSERT INTO PETRESCUE VALUES 
                (1,'Cat',9,450.09,'2018-05-29'), 
                (2,'Dog',3,666.66,'2018-06-01'), 
                (3,'Dog',1,100.00,'2018-06-04'), 
                (4,'Parrot',2,50.00,'2018-06-04'), 
                (5,'Dog',1,75.75,'2018-06-10'), 
                (6,'Hamster',6,60.60,'2018-06-11'), 
                (7,'Cat',1,44.44,'2018-06-11'), 
                (8,'Goldfish',24,48.48,'2018-06-14'), 
                (9,'Dog',2,222.22,'2018-06-15');''')

# Overview of Data

In [7]:
# Print all of the table (be careful if the table is too large)
query = '''SELECT * FROM PETRESCUE;'''
df = pd.read_sql_query(query, connection)
df

   ID    ANIMAL  QUANTITY    COST  RESCUEDATE
0   1       Cat         9  450.09  2018-05-29
1   2       Dog         3  666.66  2018-06-01
2   3       Dog         1  100.00  2018-06-04
3   4    Parrot         2   50.00  2018-06-04
4   5       Dog         1   75.75  2018-06-10
5   6   Hamster         6   60.60  2018-06-11
6   7       Cat         1   44.44  2018-06-11
7   8  Goldfish        24   48.48  2018-06-14
8   9       Dog         2  222.22  2018-06-15

In [8]:
# Commit your changes to save them to the database
connection.commit()

In [9]:
# Close connection
cursor.close()
connection.close()